---
kind: property
id: P:Autodesk.Revit.DB.TextNode.IsBold
source: html/9760666a-f4ed-6537-77b4-34e566617551.htm
---
# Autodesk.Revit.DB.TextNode.IsBold Property

Indicates whether the default formatting is set to bold text.

## Syntax (C#)
```csharp
public bool IsBold { get; }
```